In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [3]:
ser1 = 2*ser1
ser1

a    0
b    2
c    4
dtype: int32

In [9]:
ser1['b']

2

In [5]:
ser1[1]

2

In [6]:
ser1

a    0
b    2
c    4
dtype: int32

In [8]:
ser1['b']

2

In [10]:
ser1[0:3]

a    0
b    2
c    4
dtype: int32

In [15]:
ser1[['b','a']]

b    2
a    0
dtype: int32

In [16]:
ser1[ser1>3] = 10

In [17]:
ser1

a     0
b     2
c    10
dtype: int32

In [24]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','Chi','SF','LA','DC'],columns=['A','B','D','E','F'])

In [25]:
dframe

      A   B   D   E   F
NYC   0   1   2   3   4
Chi   5   6   7   8   9
SF   10  11  12  13  14
LA   15  16  17  18  19
DC   20  21  22  23  24

In [26]:
dframe['B']

NYC     1
Chi     6
SF     11
LA     16
DC     21
Name: B, dtype: int32

In [27]:
dframe[['B','E']]

      B   E
NYC   1   3
Chi   6   8
SF   11  13
LA   16  18
DC   21  23

In [33]:
dframe

      A   B   D   E   F
NYC   0   1   2   3   4
Chi   5   6   7   8   9
SF   10  11  12  13  14
LA   15  16  17  18  19
DC   20  21  22  23  24

In [34]:
dframe[dframe['D']>8]

     A   B   D   E   F
SF  10  11  12  13  14
LA  15  16  17  18  19
DC  20  21  22  23  24

In [35]:
dframe

      A   B   D   E   F
NYC   0   1   2   3   4
Chi   5   6   7   8   9
SF   10  11  12  13  14
LA   15  16  17  18  19
DC   20  21  22  23  24

In [38]:
dframe > 10 # boolean test of dataframe

         A      B      D      E      F
NYC  False  False  False  False  False
Chi  False  False  False  False  False
SF   False   True   True   True   True
LA    True   True   True   True   True
DC    True   True   True   True   True

In [39]:
dframe.ix[1]

C:\Users\Nenad\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

A    5
B    6
D    7
E    8
F    9
Name: Chi, dtype: int32

In [41]:
dframe.iloc[1]

A    5
B    6
D    7
E    8
F    9
Name: Chi, dtype: int32

In [46]:
dframe.loc['LA']

A    15
B    16
D    17
E    18
F    19
Name: LA, dtype: int32